//=============================================================================
//
// ゲームエディターモードのディスプレイ出力 [EditToolDebugProc.h]
// Author : GP11B132 14 ゴショウケン
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//MainEditMenu
void MainEditDebugProc();
//PlatFormEditMenu
void PlatFormModeDebugProc();
//EnemyEditMenu
void EnemyModeDebugProc();