/*******************************************************************************
* タイトル:		EnemyFile
* プログラム名:	EnemyFile.h
* 作成者:		GP11B132 14 ゴショウケン
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "player.h"
#include "enemy.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/



/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct	ENEMYSAVEDATA				// セーブデータの構造体
{
	// プレイヤーデータを保存
	//PLAYER player[MAX_PLAYER];	// プレイヤーのMAX人数分セーブする

	// エネミーデータを保存
	ENEMY   enemy[MAX_ENEMY];	// エネミーのMAX人数分セーブする

	// 何かセーブしたい物があればここに追加してみよう
	//PLATFORM platform[MAX_PLATFORM];

};



/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void SaveEnemyData(void);
bool LoadEnemyData(void);

void UpgradeSaveEnemyData(void);
bool UpgradeLoadEnemyData(void);


